In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### Load dataset

In [57]:
df = pd.read_csv('Salary_Data.csv')
df_salary = df.copy()
df_salary.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [58]:
#Rename columns

names = {'Age':'age', 'Gender':'gender', 'Education Level':'education_level',
         'Job Title':'job_title', 'Years of Experience':'experience_years', 'Salary':'salary'}

df_salary.rename(columns=names, inplace=True)
df_salary.head()

    age  gender education_level          job_title  experience_years    salary
0  32.0    Male      Bachelor's  Software Engineer               5.0   90000.0
1  28.0  Female        Master's       Data Analyst               3.0   65000.0
2  45.0    Male             PhD     Senior Manager              15.0  150000.0
3  36.0  Female      Bachelor's    Sales Associate               7.0   60000.0
4  52.0    Male        Master's           Director              20.0  200000.0

In [63]:
# get top 5 jobs by count
top_jobs = df_salary['job_title'].value_counts()
top_jobs =  top_jobs.head(5).index.to_list()

# filter dataset
df_salary = df_salary[df_salary['job_title'].isin(top_jobs)]